import random
import os
import sys

from Scene.SceneController import *
from Scene.map import *
from Scene.Person.Inventory import *
from Scene.bot import *
import time
import math


def setMap(param):
    if input() != "y":
        print("Долбаеб")
        return
    print("Съебался")
    l = []
    for i in param:
        l.append(i)
    l[0].map = l[1]
    pGet = l[0].map.Find(char=l[2].char)
    if (len(pGet)<2):
        l[0].Insert(l[2].char, l[3], obj=l[2])

def Outside(param):
    setMap(param)
    print("daun")

def GraveYard(param):
    setMap(param)
    l=[]
    for i in param:
        l.append(i)
    l[0].enemyFight = l[4]
    l[2].state = Person.__stateFight__

def chapterOne(pl:Player):
    scene= Scene(5,3)
    mapLobby = Map(5,3)
    scene.map = mapLobby
    scene.Insert(pl.char, p=Point(0,0),obj=pl)
    mapGraveYard = Map(5,3)
    mapOutside = Map(7,4)

    scene.AddSprite(Sprite("dr", ["12345","54321","09876"]))
    scene.AddSprite(Sprite("dragon_fightscene", ["""                ..                                                              ....::::....                       
              .=*=..                                                 ..::--====+++++++++++++++++====--::.. ...     
            .:====+.                                         ..:-==++++++++=++====+======-=+=---=====++=+++++==:.. 
            .:-..-=+:.                                 ..:=+++++++++++=+==========----==--------============-:--=..
            .....:-=+-..                          ..-++*+++++=++==++==========-=------==-==---==--========-.   ....
                ..--+*+.                 .:--+++=+***+*****++*****++++++++****+++=====--------===---=====-..       
                .:=****:.               .=#*=+##%#####**********++=====-=+======+++***++=-=-====-=======+=:.       
                .+*+++-.                .... ....=#%#+*+****++==++++++***+==--=+++===--==++++=======++====:.       
              ..-++**+-.    ...:.....-..:*+:...   ..-+#*++====+**+========++**+++==------=--==+*++======-::.       
              .:+=+*++:.    ..=+::-=+**#%+-=-:.     ...-+**++==++=+*+========++++*+=======--=-=====+++===-..       
              .====+++:. ....:++=+*+=*%%%%*-==:..      ..:+**++======+*++==-=======++++==-===----=====+*++:...     
              :+==++==:.....::=+++*#%%%##**+=....        ..:=+**++======+++++=====+====+*+======----===+*++*-...   
              --:-=+=+-...==-==+#++###*##%%+..:..          ..-=++***++=====+*+============++===========+==..++..   
              ....-++*=:...:=+**##+*#%%%%%%--:...          ..-==++**##*+++=+++*+===+=---====+++=++=+++-:::...:..   
                  :+=*+=-....=***###%%%%%%*+:..          ...-==++*######*+++=+++++======--=====++++==-...   ..     
                  :+=+**+=-:..=*########%%+....       ...:-=++*#####******+++++==++======--=====+*+:...            
                 .=*=+*++*#*+++#%*#**###%%#+++=-....-===+**####**++*+++*+++=+++++=+++=========--::++=..            
                 .=*++*+==+*##*****+#*###*+***#%#*++**####**++++++++=+*++++==+==+:-+++++++====-....:+=.            
                  .=.:=+=::=++*==+=+=*******#%%%%#####***++++++=+++++++=++==-+=-:...-++++=====-.. ...:.            
                  ....--.....:--===-*++****%%%%###***+++++++==-........:......... ...-+++-::.....  ....            
                     .-+:. ..-:-=--=++=+*##%%%#***++++++=:......  .......  .....    .:++-......                    
                       =-...=---=-++++===*#%%%%**+++*:                               .=+-.                         
                       ....:---=+===*+==++#%%%%%#+=..                                 .+=.                         
                           :+=-++*++#****++#%%%%%#=...                                .-..                         
                           -*==+*+*=*##**+++#%%%%%%#=...                                                           
                           -++=+*++*###+=+**##%%%#####-...                                                         
                           -+*+++****##+=+*#%%%%%####%%#*=:...                                                     
                       .....+*##*#**+#*==+#%%%%%#**#####%%%#+:.                                                    
                   ...:-=+++**#%#**+**==+#%%%%%##*##**##%######+:..                                                
                   ..... ...:*###****+=*#%%%%%##**#**###########%#=..                                              
                     ...   ..=*#+--+++*#%%%%+-.:**####%#**###*#####*:..                                            
                   .....   .:+*#*:.+++#%%%%%##++*#####=. ..:-+#####**:.                                            
                   .....-+*++****=-*+#######%###*##%%*:.     ..=#####=..                                           
                ...-====++###*+****++#*-:+##%**######%=.....  .:#####+..                                           
              ..=+====----:===+*+****+*++*###*..=*#####*#####*#######-..                                           
          ..:========+=-:::-*#####%#**%##*###.. .:*##%#***######***+:..                                            
     ...:=+==----=-----==-:====+*****###*#*****#++***#+..:-----:.....                                              
....-====-=---------:-------+-=-=====++++*##*******#*#........                                                     
....:-=====------:---------=-+#+===-===-===+++*******###*=-::...........                                           
 ........:---:----::-:--===-=++=========+++++*+++++++***#**#####*=::::::......                                     
  ..   ......:-----:-----==--=========++====+++++++++++++++***************+=:...                                   
         ..........:::::----------------------------------:-:::::::::::.........                                   
         ...   .. .....................................................                                            """]))

    butler = Person(name=("Дворецкий"),race = 0, aggresive= 2, char= "d" )
    scene.Insert(char=butler.char, p=Point(6,0),obj=butler,canInter=True,collision=True)
    scene.AddSprite(Sprite(butler.char,["^ ^  ","(﹀( ","###  "]))
    butler.inter.AddInteraction(Interact(interactName=("say"), delAferUse=True,action= ("“Здравствуйте, принц”- поклонился и снова пристально стал рассматривать вас "\
                                                                               "\n“как видите дела идут у нас не очень хорошо,"\
                                                                               "\n столица держится из последних сил, а самое главное, что семейную реликвию украли”."
                                                                               "\nУкрали святой меч, "+colored("Хрустальная роза,","magenta")+" рапира которая передавалась из поколения в поколение этому королевству. "
                                                                               "\n Хрустальная рапира, которая была прочнее любого алмаза и прекраснее любого цветка")))

    dragon = Person("dragon",0,sys.maxsize,'dr')
    dragon.LevleUp(10)
    dragon.health = 0#dragon.attributes.strenght/2
    dragon.point = Point(9,0)
    dragon.inventory.Add(Ithem("Rapire blue rose","хуй",0,1))
    mapGraveYard.Insert(dragon.char, p=dragon.point, obj=dragon)

    quest1 = Person(name=("quest 1"),race=0, aggresive=0, char= "q1" )
    scene.Insert(char=quest1.char, p=Point(4,0),obj=quest1,canInter=True,collision=True)
    scene.AddSprite(Sprite(quest1.char,[" ### "," #*#"," ### "]))
    quest1.inter.AddInteraction(Interact("hui", "Вы попали в гробницу, хотите войти(y/n)",False, GraveYard, scene,mapGraveYard,pl,Point(5,0),dragon))

    quest2 = Person(name=("quest 2"),race=0, aggresive=0, char= "q2" )
    scene.Insert(char=quest2.char, p=Point(7,0),obj=quest2,canInter=True,collision=True)
    scene.AddSprite(Sprite(quest2.char,[" *** "," ***"," ▨▨▨ "]))
    quest2.inter.AddInteraction(Interact("penis","Вы пришли во дворец и сели за свой стол, хотите продолжить(y/n)",False,Outside,scene,mapOutside,pl,Point(0,0)))

    doorGravyYard = Person("door",0,0,'door')
    doorGravyYard.inter.AddInteraction(Interact("teleport","Do you wanna leave "+colored("GraveYard","yellow")+" (y/n):",False,setMap,scene,mapLobby,pl,Point(0,0)))

    print(''' ▄▄▄▄▄▄▄▄▄▄▄  ▄         ▄  ▄▄▄▄▄▄▄▄▄▄▄  ▄▄▄▄▄▄▄▄▄▄▄  ▄▄▄▄▄▄▄▄▄▄▄  ▄▄▄▄▄▄▄▄▄▄▄  ▄▄▄▄▄▄▄▄▄▄▄  ▄▄▄▄▄▄▄▄▄▄▄          ▄▄▄▄     
▐░░░░░░░░░░░▌▐░▌       ▐░▌▐░░░░░░░░░░░▌▐░░░░░░░░░░░▌▐░░░░░░░░░░░▌▐░░░░░░░░░░░▌▐░░░░░░░░░░░▌▐░░░░░░░░░░░▌       ▄█░░░░▌    
▐░█▀▀▀▀▀▀▀▀▀ ▐░▌       ▐░▌▐░█▀▀▀▀▀▀▀█░▌▐░█▀▀▀▀▀▀▀█░▌▐░█▀▀▀▀▀▀▀█░▌ ▀▀▀▀█░█▀▀▀▀ ▐░█▀▀▀▀▀▀▀▀▀ ▐░█▀▀▀▀▀▀▀█░▌      ▐░░▌▐░░▌    
▐░▌          ▐░▌       ▐░▌▐░▌       ▐░▌▐░▌       ▐░▌▐░▌       ▐░▌     ▐░▌     ▐░▌          ▐░▌       ▐░▌       ▀▀ ▐░░▌    
▐░▌          ▐░█▄▄▄▄▄▄▄█░▌▐░█▄▄▄▄▄▄▄█░▌▐░█▄▄▄▄▄▄▄█░▌▐░█▄▄▄▄▄▄▄█░▌     ▐░▌     ▐░█▄▄▄▄▄▄▄▄▄ ▐░█▄▄▄▄▄▄▄█░▌          ▐░░▌    
▐░▌          ▐░░░░░░░░░░░▌▐░░░░░░░░░░░▌▐░░░░░░░░░░░▌▐░░░░░░░░░░░▌     ▐░▌     ▐░░░░░░░░░░░▌▐░░░░░░░░░░░▌          ▐░░▌    
▐░▌          ▐░█▀▀▀▀▀▀▀█░▌▐░█▀▀▀▀▀▀▀█░▌▐░█▀▀▀▀█░█▀▀ ▐░█▀▀▀▀▀▀▀▀▀      ▐░▌     ▐░█▀▀▀▀▀▀▀▀▀ ▐░█▀▀▀▀█░█▀▀           ▐░░▌    
▐░▌          ▐░▌       ▐░▌▐░▌       ▐░▌▐░▌     ▐░▌  ▐░▌               ▐░▌     ▐░▌          ▐░▌     ▐░▌            ▐░░▌    
▐░█▄▄▄▄▄▄▄▄▄ ▐░▌       ▐░▌▐░▌       ▐░▌▐░▌      ▐░▌ ▐░▌               ▐░▌     ▐░█▄▄▄▄▄▄▄▄▄ ▐░▌      ▐░▌       ▄▄▄▄█░░█▄▄▄ 
▐░░░░░░░░░░░▌▐░▌       ▐░▌▐░▌       ▐░▌▐░▌       ▐░▌▐░▌               ▐░▌     ▐░░░░░░░░░░░▌▐░▌       ▐░▌     ▐░░░░░░░░░░░▌
 ▀▀▀▀▀▀▀▀▀▀▀  ▀         ▀  ▀         ▀  ▀         ▀  ▀                 ▀       ▀▀▀▀▀▀▀▀▀▀▀  ▀         ▀       ▀▀▀▀▀▀▀▀▀▀▀ 
                                                                                                                          ''')
    input("...")
    os.system("cls")
    print(" " \
    "\nКогда человечество достигло вершины своего развития, государства начали соперничать не за землю и золото, а за энергию." \
    "\n В недрах планеты были обнаружены кристаллы "+colored("Этерния — источники безграничной силы","cyan")+", " \
    "\nспособные питать целые города и даже менять структуру материи. " \
    "\n Сначала страны заключили союз, чтобы совместно использовать новое открытие.Но алчность правителей и страх потерять власть разрушили этот союз. "
    "\nКаждый континент объявил Этерний своей собственностью, начались тайные разработки оружия, способного подчинять энергию кристаллов. "
    "\n Когда первый взрыв Этернии стер с лица земли столицу Экрасии, было уже поздно. Мир погрузился в хаос."
    "\n Союзы рухнули, армии восстали против своих командиров, города превратились в пепел. "
    "\n"+colored("Так началась Великая Война Этерния — война, что поглотила свет цивилизации и оставила лишь тени былого величия.",  "cyan")+" ")
    print( "\n После войны между государствами некоторые страны пришли в упадок, такие как "+colored("Волдайк, Амидония, Контарелла и другие.","cyan")+", " \
    "\n Это назвали всемирным кризисом. Вся королевская семья сгинула в небытие и остался лишь младший принц, "
    "\n пребывавший в этот момент на тренировках горах." \
    "\n Вернувшись увидев картину, которая очень сильно ударила его морально. "+colored("Он решил возродить свое королевство и сразиться даже с богами, для возвращения своего дома.","yellow")+", ")
    input("...")
    os.system("cls")
    while(True):
        if pl.health <= 0:
            print("Game Over")
            return

        if scene.GetPlayer().state == 0 :
            scene.PrintMap()
            scene.PlController()

        elif scene.GetPlayer().state == 1 :
            action_pl = scene.PlFight()
            action_bot = FightBot(pl,scene.enemyFight)
            print(action_bot)
            scene.FightAction(action_bot,pl,scene.enemyFight)
            input()
            scene.FightAction(action_pl, scene.enemyFight, pl)
            input()

        time.sleep(0.1)
        os.system("cls")


